import Banner from "../Banner/Banner";
  
const BannerData = [
    {
        id: 1,
        title: 'Суперскидки на товары для гейминга',
        date: 'c 8 октября до 26 октября',
        img: './banner/icons/id1.png',
        imgRetina: './banner/icons/2x/id1@2x.jpg',
        imgWebp: './banner/icons/webp/id1.webp',
        descr: 
            [
                ['В период с 8 по 26 октября не пропустите скидки до 70% товары для геймеров. Выбирайте товары из акционного списка и при оформлении заказа укажите промокод "GAMER" для активации скидки.'],
                ['Цены снижены на компьютеры, ноутбуки, ЖК мониторы, наушники, игровые кресла, геймпады, компьютерные мыши, клавиатуры, коврики для мыши.'],
                ['Купите товары для геймеров со скидкой до 70%, гарантией  и доставкой в интернет-магазине ЭЛЕКТРОСИТИ. Выгодные цены  на товары для геймеров на electrocity.ru!']
            ]
},
    {
        id: 2,
        title: 'Кэшбэк 20% на мониторы Samsung',
        date: 'c 1 октября до 23 октября',
        img: './banner/icons/id2.jpg',
        imgRetina: './banner/icons/2x/id2@2x.jpg',
        imgWebp: './banner/icons/webp/id2.webp',
        descr: 
            [
                ['В период с 8 по 26 октября не пропустите скидки до 70% на мониторы Samsung. Выбирайте товары из акционного списка и при оформлении заказа укажите промокод "GAMER" для активации скидки.'],
                ['Цены снижены на компьютеры, ноутбуки, ЖК мониторы, наушники, игровые кресла, геймпады, компьютерные мыши, клавиатуры, коврики для мыши.'],
                ['Купите товары для геймеров со скидкой до 70%, гарантией  и доставкой в интернет-магазине ЭЛЕКТРОСИТИ. Выгодные цены  на товары для геймеров на electrocity.ru!']
            ]
    },
    {
        id: 3,
        title: 'Скидки до 30% на технику HP',
        date: 'с 28 сентября до 20 октября',
        img: './banner/icons/id3.jpg',
        imgRetina: './banner/icons/2x/id2@2x.jpg',
        imgWebp: './banner/icons/webp/id3.webp',
        descr: 
            [
                ['В период с 8 по 26 октября не пропустите скидки до 70% товары на технику HP. Выбирайте товары из акционного списка и при оформлении заказа укажите промокод "GAMER" для активации скидки.'],
                ['Цены снижены на компьютеры, ноутбуки, ЖК мониторы, наушники, игровые кресла, геймпады, компьютерные мыши, клавиатуры, коврики для мыши.'],
                ['Купите товары для геймеров со скидкой до 70%, гарантией  и доставкой в интернет-магазине ЭЛЕКТРОСИТИ. Выгодные цены  на товары для геймеров на electrocity.ru!']
            ]
    },
    {
        id: 4,
        title: 'Скидка 80% на саундбар',
        date: 'c 28 сентября до 15 октября',
        img: './banner/icons/id4.jpg',
        imgRetina: './banner/icons/2x/id4@2x.jpg',
        imgWebp: './banner/icons/webp/id4.webp',
        descr: 
            [
                ['В период с 8 по 26 октября не пропустите скидки до 80% на саундбар. Выбирайте товары из акционного списка и при оформлении заказа укажите промокод "GAMER" для активации скидки.'],
                ['Цены снижены на компьютеры, ноутбуки, ЖК мониторы, наушники, игровые кресла, геймпады, компьютерные мыши, клавиатуры, коврики для мыши.'],
                ['Купите товары для геймеров со скидкой до 70%, гарантией  и доставкой в интернет-магазине ЭЛЕКТРОСИТИ. Выгодные цены  на товары для геймеров на electrocity.ru!']
            ]
    },
    {
        id: 5,
        title: 'Скидка 50% на второй товар Bouch',
        date: 'c 15 сентября до 26 октября',
        img: './banner/icons/id5.jpg',
        imgRetina: './banner/icons/2x/id5@2x.jpg',
        imgWebp: './banner/icons/webp/id5.webp',
        descr: 
            [
                ['В период с 8 по 26 октября не пропустите скидки  50% на второй  товар Bouch. Выбирайте товары из акционного списка и при оформлении заказа укажите промокод "GAMER" для активации скидки.'],
                ['Цены снижены на компьютеры, ноутбуки, ЖК мониторы, наушники, игровые кресла, геймпады, компьютерные мыши, клавиатуры, коврики для мыши.'],
                ['Купите товары для геймеров со скидкой до 70%, гарантией  и доставкой в интернет-магазине ЭЛЕКТРОСИТИ. Выгодные цены  на товары для геймеров на electrocity.ru!']
            ]
    },
    { 
        id: 6,
        title: 'Iphone 13 в рассрочку',
        class: 'banner-apple',
        img: './banner/icons/id6.jpg',
        imgRetina: './banner/icons/2x/id6@2x.jpg',
        imgWebp: './banner/icons/webp/id6.webp',
        descr: 
            [
                ['В период с 8 по 26 октября не пропустите Iphone 13 в рассрочку. Выбирайте товары из акционного списка и при оформлении заказа укажите промокод "GAMER" для активации скидки.'],
                ['Цены снижены на компьютеры, ноутбуки, ЖК мониторы, наушники, игровые кресла, геймпады, компьютерные мыши, клавиатуры, коврики для мыши.'],
                ['Купите товары для геймеров со скидкой до 70%, гарантией  и доставкой в интернет-магазине ЭЛЕКТРОСИТИ. Выгодные цены  на товары для геймеров на electrocity.ru!']
            ]
    },
    {   
        id: 7,
        title: 'Поделись мнением!',
        img: './banner/icons/id7.png',
        imgRetina: './banner/icons/2x/id7@2x.jpg',
        imgWebp: './banner/icons/webp/id7.webp',
        descr: 
            [
                ['В период с 8 по 26 октября не пропустите скидки до 70% товары для геймеров. Выбирайте товары из акционного списка и при оформлении заказа укажите промокод "GAMER" для активации скидки.'],
                ['Цены снижены на компьютеры, ноутбуки, ЖК мониторы, наушники, игровые кресла, геймпады, компьютерные мыши, клавиатуры, коврики для мыши.'],
                ['Купите товары для геймеров со скидкой до 70%, гарантией  и доставкой в интернет-магазине ЭЛЕКТРОСИТИ. Выгодные цены  на товары для геймеров на electrocity.ru!']
            ]
    },
    {
        id: 8,
        title: 'Суперскидки по бонусной карте',
        img: './banner/icons/id8.png',
        imgRetina: './banner/icons/2x/id8@2x.jpg',
        imgWebp: './banner/icons/webp/id8.webp',
        descr: 
            [
                ['В период с 8 по 26 октября не пропустите скидки до 70% товары для геймеров. Выбирайте товары из акционного списка и при оформлении заказа укажите промокод "GAMER" для активации скидки.'],
                ['Цены снижены на компьютеры, ноутбуки, ЖК мониторы, наушники, игровые кресла, геймпады, компьютерные мыши, клавиатуры, коврики для мыши.'],
                ['Купите товары для геймеров со скидкой до 70%, гарантией  и доставкой в интернет-магазине ЭЛЕКТРОСИТИ. Выгодные цены  на товары для геймеров на electrocity.ru!']
            ]
    },
    {
        id: 9,
        title: 'Ликвидация! Скидки до 70%',
        img: './banner/icons/id9.svg',
        imgRetina: './banner/icons/2x/id9@2x.svg',
        descr: 
            [
                ['В период с 8 по 26 октября не пропустите скидки до 70% товары для геймеров. Выбирайте товары из акционного списка и при оформлении заказа укажите промокод "GAMER" для активации скидки.'],
                ['Цены снижены на компьютеры, ноутбуки, ЖК мониторы, наушники, игровые кресла, геймпады, компьютерные мыши, клавиатуры, коврики для мыши.'],
                ['Купите товары для геймеров со скидкой до 70%, гарантией  и доставкой в интернет-магазине ЭЛЕКТРОСИТИ. Выгодные цены  на товары для геймеров на electrocity.ru!']
            ]
    }


]

function Promotions () {

    return (
        <div className="promotions container">
            <h2 className="promotions__title">Акции</h2>
            <div className="propmotions__tile">
             {
                BannerData.map((item) => {
                    return (
                        <Banner 
                        img={item.img} 
                        item={item}
                        ></Banner>
                    )
                })
             }
             </div>
        </div>
    );
}

export default Promotions ;